Catalogs/MRS_КлассыМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>MRS_КлассыМеню</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодКлассаСимфони</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриоритетПрименения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Оператор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/MRS_КлассыМеню/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет класс меню по данным позиции
//
// Параметры:
//  ДанныеПозиции - Структура - данные позиции меню для проверки условий
//    * СтавкаНДС - Число
//    * МернаяЕдиницаИзмерения - Булево
//    * СвободнаяЦена - Булево
//    * ЕдиницаИзмерения - СправочникСсылка.УпаковкиЕдиницыИзмерения
//    * Номенклатура - СправочникСсылка.Номенклатура
//    * Наименование - Строка (для сообщений об ошибке)
//
// Возвращаемое значение:
//  Число - код класса меню для Simphony
//
Функция ОпределитьКлассМенюПоДанным(ДанныеПозиции) Экспорт
	
	// Получаем все элементы справочника, упорядоченные по приоритету
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассыМеню.Ссылка КАК Ссылка,
		|	КлассыМеню.КодКлассаСимфони КАК КодКлассаСимфони,
		|	КлассыМеню.Наименование КАК Наименование
		|ИЗ
		|	Справочник.MRS_КлассыМеню КАК КлассыМеню
		|ГДЕ
		|	НЕ КлассыМеню.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлассыМеню.ПриоритетПрименения";
	
	ВыборкаКлассов = Запрос.Выполнить().Выбрать();
	
	// Проверяем каждый класс по порядку приоритета
	Пока ВыборкаКлассов.Следующий() Цикл
		
		// Проверяем все условия для текущего класса
		Если ПроверитьВсеУсловияКласса(ВыборкаКлассов.Ссылка, ДанныеПозиции) Тогда
			Возврат ВыборкаКлассов.КодКлассаСимфони;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если ни один класс не подошел - ошибка
	НаименованиеПозиции = "";
	Если ДанныеПозиции.Свойство("Наименование", НаименованиеПозиции) Тогда
		
		ТекстОшибки = СтрШаблон(
			"Не удалось определить класс меню для позиции ""%1"". Проверьте настройки справочника MRS_КлассыМеню.",
			НаименованиеПозиции
		);
		
	Иначе
		
		ТекстОшибки = "Не удалось определить класс меню. Проверьте настройки справочника MRS_КлассыМеню.";
		
	КонецЕсли;
	
	ВызватьИсключение ТекстОшибки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет все условия для конкретного класса меню
//
// Параметры:
//  СсылкаКласса - СправочникСсылка.MRS_КлассыМеню
//  ДанныеПозиции - Структура
//
// Возвращаемое значение:
//  Булево - Истина, если ВСЕ условия выполнены
//
Функция ПроверитьВсеУсловияКласса(СсылкаКласса, ДанныеПозиции)
	
	// Получаем все условия для класса
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Условия.ВидУсловия КАК ВидУсловия,
		|	Условия.Оператор КАК Оператор,
		|	Условия.Значение КАК Значение
		|ИЗ
		|	Справочник.MRS_КлассыМеню.Условия КАК Условия
		|ГДЕ
		|	Условия.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаКласса);
	
	ВыборкаУсловий = Запрос.Выполнить().Выбрать();
	
	// Если нет условий - класс подходит всегда (для класса по умолчанию)
	Если ВыборкаУсловий.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Проверяем каждое условие (логика И - все должны быть истиной)
	Пока ВыборкаУсловий.Следующий() Цикл
		
		// Получаем значение поля из данных позиции
		Если НЕ ДанныеПозиции.Свойство(ВыборкаУсловий.ВидУсловия) Тогда
			// Если поле не найдено - условие не выполнено
			Возврат Ложь;
		КонецЕсли;
		
		ЗначениеПоля = ДанныеПозиции[ВыборкаУсловий.ВидУсловия];
		
		// Выполняем сравнение
		Если НЕ ВыполнитьСравнение(ЗначениеПоля, ВыборкаУсловий.Оператор, ВыборкаУсловий.Значение) Тогда
			// Если хотя бы одно условие не выполнено - класс не подходит
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Все условия выполнены
	Возврат Истина;
	
КонецФункции

// Выполняет сравнение значения с эталоном по заданному оператору
//
// Параметры:
//  ЗначениеПоля - Произвольный - значение из данных позиции
//  Оператор - Строка - оператор сравнения
//  ЗначениеУсловия - Произвольный - эталонное значение из условия
//
// Возвращаемое значение:
//  Булево - результат сравнения
//
Функция ВыполнитьСравнение(ЗначениеПоля, Оператор, ЗначениеУсловия)
	
	Если Оператор = "Равно" Тогда
		
		Возврат ЗначениеПоля = ЗначениеУсловия;
		
	ИначеЕсли Оператор = "НеРавно" Тогда
		
		Возврат ЗначениеПоля <> ЗначениеУсловия;
		
	ИначеЕсли Оператор = "Больше" Тогда
		
		Возврат ЗначениеПоля > ЗначениеУсловия;
		
	ИначеЕсли Оператор = "БольшеИлиРавно" Тогда
		
		Возврат ЗначениеПоля >= ЗначениеУсловия;
		
	ИначеЕсли Оператор = "Меньше" Тогда
		
		Возврат ЗначениеПоля < ЗначениеУсловия;
		
	ИначеЕсли Оператор = "МеньшеИлиРавно" Тогда
		
		Возврат ЗначениеПоля <= ЗначениеУсловия;
		
	ИначеЕсли Оператор = "Содержит" Тогда
		
		Попытка
			Возврат СтрНайти(Строка(ЗначениеПоля), Строка(ЗначениеУсловия)) > 0;
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
	ИначеЕсли Оператор = "НеСодержит" Тогда
		
		Попытка
			Возврат СтрНайти(Строка(ЗначениеПоля), Строка(ЗначениеУсловия)) = 0;
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
	ИначеЕсли Оператор = "Заполнено" Тогда
		
		Возврат ЗначениеЗаполнено(ЗначениеПоля);
		
	ИначеЕсли Оператор = "НеЗаполнено" Тогда
		
		Возврат НЕ ЗначениеЗаполнено(ЗначениеПоля);
		
	Иначе
		
		ВызватьИсключение СтрШаблон("Неизвестный оператор сравнения: ""%1""", Оператор);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
